InformationRegisters/ИсторияИспользованияКомпьютеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>ИсторияИспользованияКомпьютеров</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Компьютер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Компьютеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГруппаПользователей</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаНачалаПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаОкончанияПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИсторияИспользованияКомпьютеров/Ext/ManagerModule.bsl
Процедура ОчиститьИсторию(Полностью = Ложь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);

	// Выборка данных.
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ИсторияИспользованияКомпьютеров.Компьютер,
	                      |	ИсторияИспользованияКомпьютеров.Пользователь,
	                      |	ИсторияИспользованияКомпьютеров.ГруппаПользователей,
	                      |	ИсторияИспользованияКомпьютеров.ДатаНачалаПериода,
	                      |	ИсторияИспользованияКомпьютеров.ДатаОкончанияПериода
	                      |ИЗ
	                      |	РегистрСведений.ИсторияИспользованияКомпьютеров КАК ИсторияИспользованияКомпьютеров
	                      |ГДЕ
	                      |	НЕ ИсторияИспользованияКомпьютеров.ДатаОкончанияПериода = ДАТАВРЕМЯ(1, 1, 1)
	                      |
	                      |ДЛЯ ИЗМЕНЕНИЯ");
	Запрос.УстановитьПараметр("ДатаОкончанияПериода", РегистрыСведений.__НастройкиВебСервиса.ПолучитьГраницуХраненияНеактивнныхСенасов());
	РузультатЗапроса = Запрос.Выполнить();
	
	Если Не РузультатЗапроса.Пустой() Тогда
		
		НачатьТранзакцию();
		
		// Удаление данных.
		Запись = РегистрыСведений.ИсторияИспользованияКомпьютеров.СоздатьМенеджерЗаписи();
		
		Выборка = РузультатЗапроса.Выбрать(); Пока Выборка.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(Запись, Выборка);
			Попытка
				Запись.Удалить();
			Исключение
				ОтменитьТранзакцию(); // ERR
				Прервать;
				// TODO
			КонецПопытки;
		КонецЦикла;
		
		Если ТранзакцияАктивна() Тогда
			ЗафиксироватьТранзакцию();
		КонецЕсли;
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры // ОчиститьИсторию()


Процедура ПриЗаписиКомпьютера(Компьютер, Отказ) Экспорт
	
	// При обмене данными ничего не проверяем.
	Если Компьютер.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Отказ Тогда
		
		ТекущаяДата = ТекущаяДата();
		
		УстановитьПривилегированныйРежим(Истина);
		
		// Закрываемые.
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	ИсторияИспользованияКомпьютеров.Компьютер,
		                      |	ИсторияИспользованияКомпьютеров.Пользователь,
		                      |	ИсторияИспользованияКомпьютеров.ГруппаПользователей,
		                      |	ИсторияИспользованияКомпьютеров.ДатаНачалаПериода,
		                      |	ИсторияИспользованияКомпьютеров.ДатаОкончанияПериода
		                      |ИЗ
		                      |	РегистрСведений.ИсторияИспользованияКомпьютеров КАК ИсторияИспользованияКомпьютеров
		                      |ГДЕ
		                      |	ИсторияИспользованияКомпьютеров.Компьютер = &Компьютер
		                      |	И (НЕ ИсторияИспользованияКомпьютеров.Пользователь = &Пользователь)
		                      |	И (НЕ ИсторияИспользованияКомпьютеров.ГруппаПользователей = &ГруппаПользователей)
		                      |	И ИсторияИспользованияКомпьютеров.ДатаОкончанияПериода = ДАТАВРЕМЯ(1, 1, 1)");
		Запрос.УстановитьПараметр("Компьютер", Компьютер.Ссылка);
		Запрос.УстановитьПараметр("Пользователь", Компьютер.Пользователь);
		Запрос.УстановитьПараметр("ГруппаПользователей", Компьютер.ГруппаПользователей);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Запись = РегистрыСведений.ИсторияИспользованияКомпьютеров.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(Запись, Выборка);
			Запись.Прочитать();
			
			Запись.ДатаОкончанияПериода = ТекущаяДата;
			
			Попытка
				Запись.Записать();
			Исключение
				Отказ = Истина; // ERR
				Прервать;
			КонецПопытки;
		КонецЦикла;
		
		
		// Открываемые.
		Если Не Отказ Тогда
			Если ЗначениеЗаполнено(Компьютер.Пользователь) Тогда
				
				Запрос = Новый Запрос("ВЫБРАТЬ
				                      |	ИсторияИспользованияКомпьютеров.Компьютер
				                      |ИЗ
				                      |	РегистрСведений.ИсторияИспользованияКомпьютеров КАК ИсторияИспользованияКомпьютеров
				                      |ГДЕ
				                      |	ИсторияИспользованияКомпьютеров.Компьютер = &Компьютер
				                      |	И ИсторияИспользованияКомпьютеров.Пользователь = &Пользователь
				                      |	И ИсторияИспользованияКомпьютеров.ГруппаПользователей = &ГруппаПользователей
				                      |	И ИсторияИспользованияКомпьютеров.ДатаОкончанияПериода = ДАТАВРЕМЯ(1, 1, 1)");
				Запрос.УстановитьПараметр("Компьютер", Компьютер.Ссылка);
				Запрос.УстановитьПараметр("Пользователь", Компьютер.Пользователь);
				Запрос.УстановитьПараметр("ГруппаПользователей", Компьютер.ГруппаПользователей);
				РезультатЗапроса = Запрос.Выполнить();
				
				Если РезультатЗапроса.Пустой() Тогда
					Запись = РегистрыСведений.ИсторияИспользованияКомпьютеров.СоздатьМенеджерЗаписи();
					ЗаполнитьЗначенияСвойств(Запись, Компьютер);
					Запись.Компьютер = Компьютер.Ссылка;
					Запись.ДатаНачалаПериода = ТекущаяДата;
					
					Попытка
						Запись.Записать();
					Исключение
						Отказ = Истина; // ERR
					КонецПопытки;
				КонецЕсли;
			
			КонецЕсли; 
		КонецЕсли; 
		
		УстановитьПривилегированныйРежим(Ложь);

	КонецЕсли;
	
КонецПроцедуры // ПриЗаписиКомпьютера()
